#include<iostream>
#include<vector>
#include<string>
#include"header.h"
using namespace std;

void Data(vector<Item> &item, int& size)
{

	Item temp[10];
	temp[0] = { "Молоко", "Яготын", 20, "Молочка", "20.05.2023", "25.05.2023" };
	temp[1] = { "Сыр", "Дружба", 21, "Молочка", "19.05.2023", "24.05.2023" };
	temp[2] = { "Сметана", "Злагода", 30, "Молочка", "18.05.2023", "30.05.2023" };
	temp[3] = { "Майонез", "Кальве", 40, "Молочка", "17.05.2023", "22.05.2023" };

	temp[4] = { "Колбаса", "Алан", 30, "Мясная", "20.05.2023", "25.05.2023" };
	temp[5] = { "Стейк", "Рокфор", 32, "Мясная", "19.05.2023", "24.05.2023" };
	temp[6] = { "Курица", "Ряба", 40, "Мясная", "18.05.2023", "30.05.2023" };

	temp[7] = { "Редис", "Овен", 35, "Овощи", "21.05.2023", "30.06.2023" };
	temp[8] = { "Лук", "Овен", 39, "Овощи", "21.05.2023", "30.06.2023" };
	temp[9] = { "Лук", "Колос", 40, "Овощи", "24.05.2023", "30.06.2023" };

	for(int i = 0; i < size; i++)
		item.push_back(temp[i]);
}
