#include<iostream>
#include<string>
#include"header.h"
using namespace std;

void Data(Item item[], int& size)
{
	item[0] = { "Молоко", "Яготын", 20, "Молочка", "20.05.2023", "25.05.2023" };
	item[1] = { "Сыр", "Дружба", 21, "Молочка", "19.05.2023", "24.05.2023" };
	item[2] = { "Сметана", "Злагода", 30, "Молочка", "18.05.2023", "30.05.2023" };
	item[3] = { "Майонез", "Кальве", 40, "Молочка", "17.05.2023", "22.05.2023" };

	item[4] = { "Колбаса", "Алан", 30, "Мясная", "20.05.2023", "25.05.2023" };
	item[5] = { "Стейк", "Рокфор", 32, "Мясная", "19.05.2023", "24.05.2023" };
	item[6] = { "Курица", "Ряба", 40, "Мясная", "18.05.2023", "30.05.2023" };

	item[7] = { "Редис", "Овен", 35, "Овощи", "21.05.2023", "30.06.2023" };
	item[8] = { "Лук", "Овен", 39, "Овощи", "21.05.2023", "30.06.2023" };
}
